import React from "react";
import './Feed.scss';
import Session from "../Session/Session";

const data = [
    {
        category: 'games',
        title: 'כותרת ערוץ כותרת ערוץ כותרת ערוץ',
        desc: 'על הערוץתקציר על הערוץתקציר על הערוץתקציר עעל הערוץתקציר על הערוץתקציר על הערוץתקציר עעל הערוץתקציר על הערוץתקציר על הערוץתקציר עעל הערוץתקציר על הערוץתקציר על הערוץתקציר עעל הערוץתקציר על הערוץתקציר על הערוץתקציר עעל הערוץתקציר על הערוץתקציר על הערוץתקציר עעל הערוץתקציר על הערוץתקציר על הערוץתקציר עעל הערוץתקציר על הערוץתקציר על הערוץתקציר עעל הערוץתקציר על הערוץתקציר על הערוץתקציר עעל הערוץתקציר על הערוץתקציר על הערוץתקציר ע',
        date: '08/01/2020',
        hour: '16:11'
    },
    {
        category: 'celebs',
        title: 'כותרת ערוץ כותרת ערוץ כותרת ערוץ',
        desc: 'תקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץ',
        date: '21/03/2020',
        hour: '13:21'
    },
    {
        category: 'games',
        title: 'כותרת ערוץ',
        desc: 'תקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץ',
        date: '21/03/2020',
        hour: '13:21'
    },
    {
        category: 'celebs',
        title: 'כותרת ערוץ',
        desc: 'תקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץ',
        date: '21/03/2020',
        hour: '13:21'
    },
    {
        category: 'fun',
        title: 'כותרת ערוץ',
        desc: 'תקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץ',
        date: '21/03/2020',
        hour: '13:21'
    }
];

const Feed = () => {
    const renderSessions = () => data.map((session, i) => <Session data={session} className={i === 0 ? 'Session__first' : ''} key={i} />);

    return (
        <div className='Feed'>
            {renderSessions()}
        </div>
    )
};

export default Feed;