import {sessionActions} from '../actions/enums';

export default (state=[], action) => {
    switch (action.type) {
        case sessionActions.FETCH_SESSIONS:
            return state;
        default:
            return [
                {
                    category: 'games',
                    title: 'כותרת ערוץ כותרת ערוץ כותרת ערוץ',
                    desc: 'על הערוץתקציר על הערוץתקציר על הערוץתקציר עעל הערוץתקציר על הערוץתקציר על הערוץתקציר עעל הערוץתקציר על הערוץתקציר על הערוץתקציר עעל הערוץתקציר על הערוץתקציר על הערוץתקציר עעל הערוץתקציר על הערוץתקציר על הערוץתקציר עעל הערוץתקציר על הערוץתקציר על הערוץתקציר עעל הערוץתקציר על הערוץתקציר על הערוץתקציר עעל הערוץתקציר על הערוץתקציר על הערוץתקציר עעל הערוץתקציר על הערוץתקציר על הערוץתקציר עעל הערוץתקציר על הערוץתקציר על הערוץתקציר ע',
                    date: '08/01/2020',
                    hour: '16:11'
                },
                {
                    category: 'celebs',
                    title: 'כותרת ערוץ כותרת ערוץ כותרת ערוץ',
                    desc: 'תקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץ',
                    date: '21/03/2020',
                    hour: '13:21'
                },
                {
                    category: 'games',
                    title: 'כותרת ערוץ',
                    desc: 'תקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץ',
                    date: '21/03/2020',
                    hour: '13:21'
                },
                {
                    category: 'celebs',
                    title: 'כותרת ערוץ',
                    desc: 'תקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץ',
                    date: '21/03/2020',
                    hour: '13:21'
                },
                {
                    category: 'fun',
                    title: 'כותרת ערוץ',
                    desc: 'תקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץתקציר על הערוץ',
                    date: '21/03/2020',
                    hour: '13:21'
                }
            ];
    }
}